ERP.belugaerp/src/AccumulationRegisters/бг_ОперацииПоФакторингу/бг_ОперацииПоФакторингу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>бг_ОперацииПоФакторингу</name>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <comment>Сумма в валюте регламентированного учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.бг_ВидыОперацийФакторинга</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фактор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорФактора</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРеализации</name>
    <comment>Незакрытый документ поставки/оплаты</comment>
    <type>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчетов</name>
    <type>
      <types>EnumRef.бг_ВидРасчетовПоФакторингу</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP.belugaerp/src/Documents/битФакторинг/битФакторинг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битФакторинг</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_ОперацииПоФакторингу</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.бг_ВидыОперацийФакторинга</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Фактор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорФактора</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчетаКонтрагента</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчетаФактора</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСтатьяАктивовЗадолженностьКлиентов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыРеализации</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРеализации</name>
      <type>
        <types>DocumentRef.ПервичныйДокумент</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ПервичныйДокумент</name>
      <type>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаФинансирования</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комиссия1</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комиссия2</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комиссия3</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомиссияБезНДС1</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомиссияНДС1</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомиссияБезНДС2</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомиссияНДС2</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомиссияБезНДС3</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомиссияНДС3</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПогашенияФинансирования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальнаяСуммаСчетФактуры</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРасчетов</name>
      <type>
        <types>CatalogRef.ОбъектыРасчетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/AccumulationRegisters/бг_ОперацииПоФакторингу/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		Или ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	ВременнаяТаблицаЗаписейДоИзменения();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ОбменДанными.Загрузка
		Или ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	ВременнаяТаблицаИзменений();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВременнаяТаблицаЗаписейДоИзменения()
	
	Если Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОперацииПоФакторингу.Период КАК Период,
	|	ОперацииПоФакторингу.Организация КАК Организация,
	|	ОперацииПоФакторингу.Контрагент КАК Контрагент,
	|	ОперацииПоФакторингу.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ОперацииПоФакторингу.Фактор КАК Фактор,
	|	ОперацииПоФакторингу.ДоговорФактора КАК ДоговорФактора,
	|	ОперацииПоФакторингу.ДокументРеализации КАК ДокументРеализации,
	|	ОперацииПоФакторингу.ВидРасчетов КАК ВидРасчетов,
	|	ОперацииПоФакторингу.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ОперацииПоФакторингу.ПервичныйДокумент КАК ПервичныйДокумент,
	|	ОперацииПоФакторингу.ВидОперации КАК ВидОперации,
	|	ОперацииПоФакторингу.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ОперацииПоФакторингу.СуммаРегл КАК СуммаРегл,
	|	РеквизитыФакторинга.Подразделение,
	|	РеквизитыФакторинга.СтатьяДоходов,
	|	РеквизитыФакторинга.СтатьяРасходов,
	|	РеквизитыФакторинга.КорСтатьяАктивовЗадолженностьКлиентов
	|ПОМЕСТИТЬ бг_ОперацииПоФакторингуПередЗаписью
	|ИЗ
	|	РегистрНакопления.бг_ОперацииПоФакторингу КАК ОперацииПоФакторингу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.битФакторинг КАК РеквизитыФакторинга
	|		ПО ОперацииПоФакторингу.Регистратор = РеквизитыФакторинга.Ссылка
	|ГДЕ
	|	ОперацииПоФакторингу.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ВременнаяТаблицаИзменений()
	
	Если Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.Период КАК Период,
	|	ТаблицаИзменений.Организация КАК Организация,
	|	ТаблицаИзменений.Контрагент КАК Контрагент,
	|	ТаблицаИзменений.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаИзменений.Фактор КАК Фактор,
	|	ТаблицаИзменений.ДоговорФактора КАК ДоговорФактора,
	|	ТаблицаИзменений.ДокументРеализации КАК ДокументРеализации,
	|	ТаблицаИзменений.ВидРасчетов КАК ВидРасчетов,
	|	ТаблицаИзменений.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ТаблицаИзменений.ПервичныйДокумент КАК ПервичныйДокумент,
	|	ТаблицаИзменений.ВидОперации КАК ВидОперации,
	|	ТаблицаИзменений.Подразделение КАК Подразделение,
	|	ТаблицаИзменений.СтатьяДоходов КАК СтатьяДоходов,
	|	ТаблицаИзменений.СтатьяРасходов КАК СтатьяРасходов,
	|	ТаблицаИзменений.КорСтатьяАктивовЗадолженностьКлиентов КАК КорСтатьяАктивовЗадолженностьКлиентов,
	|	СУММА(ТаблицаИзменений.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
	|	СУММА(ТаблицаИзменений.СуммаРегл) КАК СуммаРегл
	|ПОМЕСТИТЬ ТаблицаИзмененийбг_ОперацииПоФакторингу
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОперацииПоФакторингу.Период КАК Период,
	|		ОперацииПоФакторингу.Организация КАК Организация,
	|		ОперацииПоФакторингу.Контрагент КАК Контрагент,
	|		ОперацииПоФакторингу.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|		ОперацииПоФакторингу.Фактор КАК Фактор,
	|		ОперацииПоФакторингу.ДоговорФактора КАК ДоговорФактора,
	|		ОперацииПоФакторингу.ДокументРеализации КАК ДокументРеализации,
	|		ОперацииПоФакторингу.ВидРасчетов КАК ВидРасчетов,
	|		ОперацииПоФакторингу.ОбъектРасчетов КАК ОбъектРасчетов,
	|		ОперацииПоФакторингу.ПервичныйДокумент КАК ПервичныйДокумент,
	|		ОперацииПоФакторингу.ВидОперации КАК ВидОперации,
	|		ОперацииПоФакторингу.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|		ОперацииПоФакторингу.СуммаРегл КАК СуммаРегл,
	|		ОперацииПоФакторингу.Подразделение КАК Подразделение,
	|		ОперацииПоФакторингу.СтатьяДоходов КАК СтатьяДоходов,
	|		ОперацииПоФакторингу.СтатьяРасходов КАК СтатьяРасходов,
	|		ОперацииПоФакторингу.КорСтатьяАктивовЗадолженностьКлиентов КАК КорСтатьяАктивовЗадолженностьКлиентов
	|	ИЗ
	|		бг_ОперацииПоФакторингуПередЗаписью КАК ОперацииПоФакторингу
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ОперацииПоФакторингу.Период КАК Период,
	|		ОперацииПоФакторингу.Организация,
	|		ОперацииПоФакторингу.Контрагент,
	|		ОперацииПоФакторингу.ДоговорКонтрагента,
	|		ОперацииПоФакторингу.Фактор,
	|		ОперацииПоФакторингу.ДоговорФактора,
	|		ОперацииПоФакторингу.ДокументРеализации,
	|		ОперацииПоФакторингу.ВидРасчетов,
	|		ОперацииПоФакторингу.ОбъектРасчетов,
	|		ОперацииПоФакторингу.ПервичныйДокумент,
	|		ОперацииПоФакторингу.ВидОперации,
	|		-ОперацииПоФакторингу.СуммаВзаиморасчетов,
	|		-ОперацииПоФакторингу.СуммаРегл,
	|		РеквизитыФакторинга.Подразделение,
	|		РеквизитыФакторинга.СтатьяДоходов,
	|		РеквизитыФакторинга.СтатьяРасходов,
	|		РеквизитыФакторинга.КорСтатьяАктивовЗадолженностьКлиентов
	|	ИЗ
	|		РегистрНакопления.бг_ОперацииПоФакторингу КАК ОперацииПоФакторингу
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.битФакторинг КАК РеквизитыФакторинга
	|			ПО ОперацииПоФакторингу.Регистратор = РеквизитыФакторинга.Ссылка
	|	ГДЕ
	|		ОперацииПоФакторингу.Регистратор = &Регистратор) КАК ТаблицаИзменений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.Период,
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.Контрагент,
	|	ТаблицаИзменений.ДоговорКонтрагента,
	|	ТаблицаИзменений.Фактор,
	|	ТаблицаИзменений.ДоговорФактора,
	|	ТаблицаИзменений.ДокументРеализации,
	|	ТаблицаИзменений.ВидРасчетов,
	|	ТаблицаИзменений.ОбъектРасчетов,
	|	ТаблицаИзменений.ПервичныйДокумент,
	|	ТаблицаИзменений.ВидОперации,
	|	ТаблицаИзменений.Подразделение,
	|	ТаблицаИзменений.СтатьяДоходов,
	|	ТаблицаИзменений.СтатьяРасходов,
	|	ТаблицаИзменений.КорСтатьяАктивовЗадолженностьКлиентов
	|ИМЕЮЩИЕ
	|	НЕ СУММА(ТаблицаИзменений.СуммаВзаиморасчетов) = 0
	|	ИЛИ НЕ СУММА(ТаблицаИзменений.СуммаРегл) = 0";
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
